src/test/elements/chargify/assets/invoices.json

[
  {
    "invoice": {
      "created_at": "2018-03-06T14:42:51-05:00",
      "statement_id": 110091125,
      "line_items": [
        {
          "kind": "baseline",
          "created_at": "2018-03-06T14:42:51-05:00",
          "memo": "Basic Plan (03/06/2018 - 04/06/2018)",
          "type": "Charge",
          "transaction_type": "charge",
          "starting_balance_in_cents": 0,
          "subscription_id": 21086339,
          "amount_in_cents": 1000,
          "success": true,
          "product_id": 4468608,
          "ending_balance_in_cents": 1000,
          "id": 229975068,
          "customer_id": 20702475
        }
      ],
      "subscription_id": 21086339,
      "total_amount_in_cents": 1000,
      "number": "000002",
      "payments_and_credits": [],
      "charges": [
        {
          "kind": "baseline",
          "created_at": "2018-03-06T14:42:51-05:00",
          "memo": "Basic Plan (03/06/2018 - 04/06/2018)",
          "type": "Charge",
          "transaction_type": "charge",
          "starting_balance_in_cents": 0,
          "subscription_id": 21086339,
          "amount_in_cents": 1000,
          "success": true,
          "product_id": 4468608,
          "ending_balance_in_cents": 1000,
          "id": 229975068,
          "customer_id": 20702475
        }
      ],
      "updated_at": "2018-03-06T14:42:51-05:00",
      "amount_due_in_cents": 1000,
      "site_id": 34752,
      "id": 1794923,
      "state": "unpaid"
    }
  }
]
